Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_ethernet.h
// MACL4A1R Configuration

#define ETHERNET_MACL4A1R_L4DP1                                     (0xFFFFU<<16)
#define ETHERNET_MACL4A1R_L4DP1_0                                   (0x1U<<16)
#define ETHERNET_MACL4A1R_L4SP1                                     (0xFFFFU<<0)
#define ETHERNET_MACL4A1R_L4SP1_0                                   (0x1U<<0)

// MACL3A01R Configuration

#define ETHERNET_MACL3A01R_L3A01                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MACL3A01R_L3A01_0                                  (0x1U<<0)

// MACL3A11R Configuration

#define ETHERNET_MACL3A11R_L3A11                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MACL3A11R_L3A11_0                                  (0x1U<<0)

// MACL3A21R Configuration

#define ETHERNET_MACL3A21R_L3A21                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MACL3A21R_L3A21_0                                  (0x1U<<0)

// MACL3A31R Configuration

#define ETHERNET_MACL3A31R_L3A31                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MACL3A31R_L3A31_0                                  (0x1U<<0)

// MACARPAR Configuration

#define ETHERNET_MACARPAR_ARPPA                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACARPAR_ARPPA_0                                   (0x1U<<0)

// MACTSCR Configuration

#define ETHERNET_MACTSCR_TXTSSTSM                                   (0x1U<<24)
#define ETHERNET_MACTSCR_CSC                                        (0x1U<<19)
#define ETHERNET_MACTSCR_TSENMACADDR                                (0x1U<<18)
#define ETHERNET_MACTSCR_SNAPTYPSEL                                 (0x3U<<16)
#define ETHERNET_MACTSCR_SNAPTYPSEL_0                               (0x1U<<16)
#define ETHERNET_MACTSCR_TSMSTRENA                                  (0x1U<<15)
#define ETHERNET_MACTSCR_TSEVNTENA                                  (0x1U<<14)
#define ETHERNET_MACTSCR_TSIPV4ENA                                  (0x1U<<13)
#define ETHERNET_MACTSCR_TSIPV6ENA                                  (0x1U<<12)
#define ETHERNET_MACTSCR_TSIPENA                                    (0x1U<<11)
#define ETHERNET_MACTSCR_TSVER2ENA                                  (0x1U<<10)
#define ETHERNET_MACTSCR_TSCTRLSSR                                  (0x1U<<9)
#define ETHERNET_MACTSCR_TSENALL                                    (0x1U<<8)
#define ETHERNET_MACTSCR_TSADDREG                                   (0x1U<<5)
#define ETHERNET_MACTSCR_TSUPDT                                     (0x1U<<3)
#define ETHERNET_MACTSCR_TSINIT                                     (0x1U<<2)
#define ETHERNET_MACTSCR_TSCFUPDT                                   (0x1U<<1)
#define ETHERNET_MACTSCR_TSENA                                      (0x1U<<0)

// MACSSIR Configuration

#define ETHERNET_MACSSIR_SSINC                                      (0xFFU<<16)
#define ETHERNET_MACSSIR_SSINC_0                                    (0x1U<<16)
#define ETHERNET_MACSSIR_SNSINC                                     (0xFFU<<8)
#define ETHERNET_MACSSIR_SNSINC_0                                   (0x1U<<8)

// MACSTSR Configuration

#define ETHERNET_MACSTSR_TSS                                        (0xFFFFFFFFU<<0)
#define ETHERNET_MACSTSR_TSS_0                                      (0x1U<<0)

// MACSTNR Configuration

#define ETHERNET_MACSTNR_TSSS                                       (0x7FFFFFFFU<<0)
#define ETHERNET_MACSTNR_TSSS_0                                     (0x1U<<0)

// MACSTSUR Configuration

#define ETHERNET_MACSTSUR_TSS                                       (0xFFFFFFFFU<<0)
#define ETHERNET_MACSTSUR_TSS_0                                     (0x1U<<0)

// MACSTNUR Configuration

#define ETHERNET_MACSTNUR_ADDSUB                                    (0x1U<<31)
#define ETHERNET_MACSTNUR_TSSS                                      (0x7FFFFFFFU<<0)
#define ETHERNET_MACSTNUR_TSSS_0                                    (0x1U<<0)

// MACTSAR Configuration

#define ETHERNET_MACTSAR_TSAR                                       (0xFFFFFFFFU<<0)
#define ETHERNET_MACTSAR_TSAR_0                                     (0x1U<<0)

// MACTSSR Configuration

#define ETHERNET_MACTSSR_ATSNS                                      (0x1FU<<25)
#define ETHERNET_MACTSSR_ATSNS_0                                    (0x1U<<25)
#define ETHERNET_MACTSSR_ATSSTM                                     (0x1U<<24)
#define ETHERNET_MACTSSR_ATSSTN                                     (0xFU<<16)
#define ETHERNET_MACTSSR_ATSSTN_0                                   (0x1U<<16)
#define ETHERNET_MACTSSR_TXTSSIS                                    (0x1U<<15)
#define ETHERNET_MACTSSR_TSTRGTERR0                                 (0x1U<<3)
#define ETHERNET_MACTSSR_AUXTSTRIG                                  (0x1U<<2)
#define ETHERNET_MACTSSR_TSTARGT0                                   (0x1U<<1)
#define ETHERNET_MACTSSR_TSSOVF                                     (0x1U<<0)

// MACTXTSSNR Configuration

#define ETHERNET_MACTXTSSNR_TXTSSMIS                                (0x1U<<31)
#define ETHERNET_MACTXTSSNR_TXTSSLO                                 (0x7FFFFFFFU<<0)
#define ETHERNET_MACTXTSSNR_TXTSSLO_0                               (0x1U<<0)

// MACTXTSSSR Configuration

#define ETHERNET_MACTXTSSSR_TXTSSHI                                 (0xFFFFFFFFU<<0)
#define ETHERNET_MACTXTSSSR_TXTSSHI_0                               (0x1U<<0)

// MACACR Configuration

#define ETHERNET_MACACR_ATSEN3                                      (0x1U<<7)
#define ETHERNET_MACACR_ATSEN2                                      (0x1U<<6)
#define ETHERNET_MACACR_ATSEN1                                      (0x1U<<5)
#define ETHERNET_MACACR_ATSEN0                                      (0x1U<<4)
#define ETHERNET_MACACR_ATSFC                                       (0x1U<<0)

// MACATSNR Configuration

#define ETHERNET_MACATSNR_AUXTSLO                                   (0x7FFFFFFFU<<0)
#define ETHERNET_MACATSNR_AUXTSLO_0                                 (0x1U<<0)

// MACATSSR Configuration

#define ETHERNET_MACATSSR_AUXTSHI                                   (0xFFFFFFFFU<<0)
#define ETHERNET_MACATSSR_AUXTSHI_0                                 (0x1U<<0)

