Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_ethernet.h
// MACTSIACR Configuration

#define ETHERNET_MACTSIACR_OSTIAC                                   (0xFFFFFFFFU<<0)
#define ETHERNET_MACTSIACR_OSTIAC_0                                 (0x1U<<0)

// MACTSEACR Configuration

#define ETHERNET_MACTSEACR_OSTEAC                                   (0xFFFFFFFFU<<0)
#define ETHERNET_MACTSEACR_OSTEAC_0                                 (0x1U<<0)

// MACTSICNR Configuration

#define ETHERNET_MACTSICNR_TSIC                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACTSICNR_TSIC_0                                   (0x1U<<0)

// MACTSECNR Configuration

#define ETHERNET_MACTSECNR_TSEC                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACTSECNR_TSEC_0                                   (0x1U<<0)

// MACPPSCR Configuration

#define ETHERNET_MACPPSCR_TRGTMODSEL0                               (0x3U<<5)
#define ETHERNET_MACPPSCR_TRGTMODSEL0_0                             (0x1U<<5)
#define ETHERNET_MACPPSCR_PPSEN0                                    (0x1U<<4)
#define ETHERNET_MACPPSCR_PPSCTRL                                   (0xFU<<0)
#define ETHERNET_MACPPSCR_PPSCTRL_0                                 (0x1U<<0)

// MACPPSTTSR Configuration

#define ETHERNET_MACPPSTTSR_TSTRH0                                  (0x7FFFFFFFU<<0)
#define ETHERNET_MACPPSTTSR_TSTRH0_0                                (0x1U<<0)

// MACPPSTTNR Configuration

#define ETHERNET_MACPPSTTNR_TRGTBUSY0                               (0x1U<<31)
#define ETHERNET_MACPPSTTNR_TTSL0                                   (0x7FFFFFFFU<<0)
#define ETHERNET_MACPPSTTNR_TTSL0_0                                 (0x1U<<0)

// MACPPSIR Configuration

#define ETHERNET_MACPPSIR_PPSINT0                                   (0xFFFFFFFFU<<0)
#define ETHERNET_MACPPSIR_PPSINT0_0                                 (0x1U<<0)

// MACPPSWR Configuration

#define ETHERNET_MACPPSWR_PPSWIDTH0                                 (0xFFFFFFFFU<<0)
#define ETHERNET_MACPPSWR_PPSWIDTH0_0                               (0x1U<<0)

// MACPOCR Configuration

#define ETHERNET_MACPOCR_DN                                         (0xFFU<<8)
#define ETHERNET_MACPOCR_DN_0                                       (0x1U<<8)
#define ETHERNET_MACPOCR_DRRDIS                                     (0x1U<<6)
#define ETHERNET_MACPOCR_APDREQTRIG                                 (0x1U<<5)
#define ETHERNET_MACPOCR_ASYNCTRIG                                  (0x1U<<4)
#define ETHERNET_MACPOCR_APDREQEN                                   (0x1U<<2)
#define ETHERNET_MACPOCR_ASYNCEN                                    (0x1U<<1)
#define ETHERNET_MACPOCR_PTOEN                                      (0x1U<<0)

// MACSPI0R Configuration

#define ETHERNET_MACSPI0R_SPI0                                      (0xFFFFFFFFU<<0)
#define ETHERNET_MACSPI0R_SPI0_0                                    (0x1U<<0)

// MACSPI1R Configuration

#define ETHERNET_MACSPI1R_SPI1                                      (0xFFFFFFFFU<<0)
#define ETHERNET_MACSPI1R_SPI1_0                                    (0x1U<<0)

// MACSPI2R Configuration

#define ETHERNET_MACSPI2R_SPI2                                      (0xFFFFU<<0)
#define ETHERNET_MACSPI2R_SPI2_0                                    (0x1U<<0)

// MACLMIR Configuration

#define ETHERNET_MACLMIR_LMPDRI                                     (0xFFU<<24)
#define ETHERNET_MACLMIR_LMPDRI_0                                   (0x1U<<24)
#define ETHERNET_MACLMIR_DRSYNCR                                    (0x7U<<8)
#define ETHERNET_MACLMIR_DRSYNCR_0                                  (0x1U<<8)
#define ETHERNET_MACLMIR_LSI                                        (0xFFU<<0)
#define ETHERNET_MACLMIR_LSI_0                                      (0x1U<<0)

// MTLOMR Configuration

#define ETHERNET_MTLOMR_CNTCLR                                      (0x1U<<9)
#define ETHERNET_MTLOMR_CNTPRST                                     (0x1U<<8)
#define ETHERNET_MTLOMR_DTXSTS                                      (0x1U<<1)

// MTLISR Configuration

#define ETHERNET_MTLISR_Q0IS                                        (0x1U<<0)

// MTLTXQOMR Configuration

#define ETHERNET_MTLTXQOMR_TQS                                      (0x1FFU<<16)
#define ETHERNET_MTLTXQOMR_TQS_0                                    (0x1U<<16)
#define ETHERNET_MTLTXQOMR_TTC                                      (0x7U<<4)
#define ETHERNET_MTLTXQOMR_TTC_0                                    (0x1U<<4)
#define ETHERNET_MTLTXQOMR_TXQEN                                    (0x3U<<2)
#define ETHERNET_MTLTXQOMR_TXQEN_0                                  (0x1U<<2)
#define ETHERNET_MTLTXQOMR_TSF                                      (0x1U<<1)
#define ETHERNET_MTLTXQOMR_FTQ                                      (0x1U<<0)

// MTLTXQUR Configuration

#define ETHERNET_MTLTXQUR_UFCNTOVF                                  (0x1U<<11)
#define ETHERNET_MTLTXQUR_UFFRMCNT                                  (0x7FFU<<0)
#define ETHERNET_MTLTXQUR_UFFRMCNT_0                                (0x1U<<0)

// MTLTXQDR Configuration

#define ETHERNET_MTLTXQDR_STXSTSF                                   (0x7U<<20)
#define ETHERNET_MTLTXQDR_STXSTSF_0                                 (0x1U<<20)
#define ETHERNET_MTLTXQDR_PTXQ                                      (0x7U<<16)
#define ETHERNET_MTLTXQDR_PTXQ_0                                    (0x1U<<16)
#define ETHERNET_MTLTXQDR_TXSTSFSTS                                 (0x1U<<5)
#define ETHERNET_MTLTXQDR_TXQSTS                                    (0x1U<<4)
#define ETHERNET_MTLTXQDR_TWCSTS                                    (0x1U<<3)
#define ETHERNET_MTLTXQDR_TRCSTS                                    (0x3U<<1)
#define ETHERNET_MTLTXQDR_TRCSTS_0                                  (0x1U<<1)
#define ETHERNET_MTLTXQDR_TXQPAUSED                                 (0x1U<<0)

// MTLQICSR Configuration

#define ETHERNET_MTLQICSR_RXOIE                                     (0x1U<<24)
#define ETHERNET_MTLQICSR_RXOVFIS                                   (0x1U<<16)
#define ETHERNET_MTLQICSR_TXUIE                                     (0x1U<<8)
#define ETHERNET_MTLQICSR_TXUNFIS                                   (0x1U<<0)

// MTLRXQOMR Configuration

#define ETHERNET_MTLRXQOMR_RQS                                      (0x7U<<20)
#define ETHERNET_MTLRXQOMR_RQS_0                                    (0x1U<<20)
#define ETHERNET_MTLRXQOMR_RFD                                      (0x7U<<14)
#define ETHERNET_MTLRXQOMR_RFD_0                                    (0x1U<<14)
#define ETHERNET_MTLRXQOMR_RFA                                      (0x7U<<8)
#define ETHERNET_MTLRXQOMR_RFA_0                                    (0x1U<<8)
#define ETHERNET_MTLRXQOMR_EHFC                                     (0x1U<<7)
#define ETHERNET_MTLRXQOMR_DIS_TCP_EF                               (0x1U<<6)
#define ETHERNET_MTLRXQOMR_RSF                                      (0x1U<<5)
#define ETHERNET_MTLRXQOMR_FEP                                      (0x1U<<4)
#define ETHERNET_MTLRXQOMR_FUP                                      (0x1U<<3)
#define ETHERNET_MTLRXQOMR_RTC                                      (0x3U<<0)
#define ETHERNET_MTLRXQOMR_RTC_0                                    (0x1U<<0)

// MTLRXQMPOCR Configuration

#define ETHERNET_MTLRXQMPOCR_MISCNTOVF                              (0x1U<<27)
#define ETHERNET_MTLRXQMPOCR_MISPKTCNT                              (0x7FFU<<16)
#define ETHERNET_MTLRXQMPOCR_MISPKTCNT_0                            (0x1U<<16)
#define ETHERNET_MTLRXQMPOCR_OVFCNTOVF                              (0x1U<<11)
#define ETHERNET_MTLRXQMPOCR_OVFPKTCNT                              (0x7FFU<<0)
#define ETHERNET_MTLRXQMPOCR_OVFPKTCNT_0                            (0x1U<<0)

