Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_ethernet.h
// MTLRXQDR Configuration

#define ETHERNET_MTLRXQDR_PRXQ                                      (0x3FFFU<<16)
#define ETHERNET_MTLRXQDR_PRXQ_0                                    (0x1U<<16)
#define ETHERNET_MTLRXQDR_RXQSTS                                    (0x3U<<4)
#define ETHERNET_MTLRXQDR_RXQSTS_0                                  (0x1U<<4)
#define ETHERNET_MTLRXQDR_RRCSTS                                    (0x3U<<1)
#define ETHERNET_MTLRXQDR_RRCSTS_0                                  (0x1U<<1)
#define ETHERNET_MTLRXQDR_RWCSTS                                    (0x1U<<0)

// DMAMR Configuration

#define ETHERNET_DMAMR_INTM                                         (0x1U<<16)
#define ETHERNET_DMAMR_PR                                           (0x7U<<12)
#define ETHERNET_DMAMR_PR_0                                         (0x1U<<12)
#define ETHERNET_DMAMR_TXPR                                         (0x1U<<11)
#define ETHERNET_DMAMR_DA                                           (0x1U<<1)
#define ETHERNET_DMAMR_SWR                                          (0x1U<<0)

// DMASBMR Configuration

#define ETHERNET_DMASBMR_RB                                         (0x1U<<15)
#define ETHERNET_DMASBMR_MB                                         (0x1U<<14)
#define ETHERNET_DMASBMR_AAL                                        (0x1U<<12)
#define ETHERNET_DMASBMR_FB                                         (0x1U<<0)

// DMAISR Configuration

#define ETHERNET_DMAISR_MACIS                                       (0x1U<<17)
#define ETHERNET_DMAISR_MTLIS                                       (0x1U<<16)
#define ETHERNET_DMAISR_DC0IS                                       (0x1U<<0)

// DMADSR Configuration

#define ETHERNET_DMADSR_TPS0                                        (0xFU<<12)
#define ETHERNET_DMADSR_TPS0_0                                      (0x1U<<12)
#define ETHERNET_DMADSR_RPS0                                        (0xFU<<8)
#define ETHERNET_DMADSR_RPS0_0                                      (0x1U<<8)
#define ETHERNET_DMADSR_AXWHSTS                                     (0x1U<<0)

// DMACCR Configuration

#define ETHERNET_DMACCR_DSL                                         (0x7U<<18)
#define ETHERNET_DMACCR_DSL_0                                       (0x1U<<18)
#define ETHERNET_DMACCR_PBLX8                                       (0x1U<<16)
#define ETHERNET_DMACCR_MSS                                         (0x3FFFU<<0)
#define ETHERNET_DMACCR_MSS_0                                       (0x1U<<0)

// DMACTXCR Configuration

#define ETHERNET_DMACTXCR_TXPBL                                     (0x3FU<<16)
#define ETHERNET_DMACTXCR_TXPBL_0                                   (0x1U<<16)
#define ETHERNET_DMACTXCR_TSE                                       (0x1U<<12)
#define ETHERNET_DMACTXCR_OSF                                       (0x1U<<4)
#define ETHERNET_DMACTXCR_ST                                        (0x1U<<0)

// DMACRXCR Configuration

#define ETHERNET_DMACRXCR_RPF                                       (0x1U<<31)
#define ETHERNET_DMACRXCR_RXPBL                                     (0x3FU<<16)
#define ETHERNET_DMACRXCR_RXPBL_0                                   (0x1U<<16)
#define ETHERNET_DMACRXCR_RBSZ                                      (0x3FFFU<<1)
#define ETHERNET_DMACRXCR_RBSZ_0                                    (0x1U<<1)
#define ETHERNET_DMACRXCR_SR                                        (0x1U<<0)

// DMACTXDLAR Configuration

#define ETHERNET_DMACTXDLAR_TDESLA                                  (0x3FFFFFFFU<<2)
#define ETHERNET_DMACTXDLAR_TDESLA_0                                (0x1U<<2)

// DMACRXDLAR Configuration

#define ETHERNET_DMACRXDLAR_RDESLA                                  (0x3FFFFFFFU<<2)
#define ETHERNET_DMACRXDLAR_RDESLA_0                                (0x1U<<2)

// DMACTXDTPR Configuration

#define ETHERNET_DMACTXDTPR_TDT                                     (0x3FFFFFFFU<<2)
#define ETHERNET_DMACTXDTPR_TDT_0                                   (0x1U<<2)

// DMACRXDTPR Configuration

#define ETHERNET_DMACRXDTPR_RDT                                     (0x3FFFFFFFU<<2)
#define ETHERNET_DMACRXDTPR_RDT_0                                   (0x1U<<2)

// DMACTXRLR Configuration

#define ETHERNET_DMACTXRLR_TDRL                                     (0x3FFU<<0)
#define ETHERNET_DMACTXRLR_TDRL_0                                   (0x1U<<0)

// DMACRXRLR Configuration

#define ETHERNET_DMACRXRLR_RDRL                                     (0x3FFU<<0)
#define ETHERNET_DMACRXRLR_RDRL_0                                   (0x1U<<0)

// DMACIER Configuration

#define ETHERNET_DMACIER_NIE                                        (0x1U<<15)
#define ETHERNET_DMACIER_AIE                                        (0x1U<<14)
#define ETHERNET_DMACIER_CDEE                                       (0x1U<<13)
#define ETHERNET_DMACIER_FBEE                                       (0x1U<<12)
#define ETHERNET_DMACIER_ERIE                                       (0x1U<<11)
#define ETHERNET_DMACIER_ETIE                                       (0x1U<<10)
#define ETHERNET_DMACIER_RWTE                                       (0x1U<<9)
#define ETHERNET_DMACIER_RSE                                        (0x1U<<8)
#define ETHERNET_DMACIER_RBUE                                       (0x1U<<7)
#define ETHERNET_DMACIER_RIE                                        (0x1U<<6)
#define ETHERNET_DMACIER_TBUE                                       (0x1U<<2)
#define ETHERNET_DMACIER_TXSE                                       (0x1U<<1)
#define ETHERNET_DMACIER_TIE                                        (0x1U<<0)

// DMACRXIWTR Configuration

#define ETHERNET_DMACRXIWTR_RWT                                     (0xFFU<<0)
#define ETHERNET_DMACRXIWTR_RWT_0                                   (0x1U<<0)

// DMACCATXDR Configuration

#define ETHERNET_DMACCATXDR_CURTDESAPTR                             (0xFFFFFFFFU<<0)
#define ETHERNET_DMACCATXDR_CURTDESAPTR_0                           (0x1U<<0)

// DMACCARXDR Configuration

#define ETHERNET_DMACCARXDR_CURRDESAPTR                             (0xFFFFFFFFU<<0)
#define ETHERNET_DMACCARXDR_CURRDESAPTR_0                           (0x1U<<0)

// DMACCATXBR Configuration

#define ETHERNET_DMACCATXBR_CURTBUFAPTR                             (0xFFFFFFFFU<<0)
#define ETHERNET_DMACCATXBR_CURTBUFAPTR_0                           (0x1U<<0)

// DMACCARXBR Configuration

#define ETHERNET_DMACCARXBR_CURRBUFAPTR                             (0xFFFFFFFFU<<0)
#define ETHERNET_DMACCARXBR_CURRBUFAPTR_0                           (0x1U<<0)

// DMACSR Configuration

#define ETHERNET_DMACSR_REB                                         (0x7U<<19)
#define ETHERNET_DMACSR_REB_0                                       (0x1U<<19)
#define ETHERNET_DMACSR_TEB                                         (0x7U<<16)
#define ETHERNET_DMACSR_TEB_0                                       (0x1U<<16)
#define ETHERNET_DMACSR_NIS                                         (0x1U<<15)
#define ETHERNET_DMACSR_AIS                                         (0x1U<<14)
#define ETHERNET_DMACSR_CDE                                         (0x1U<<13)
#define ETHERNET_DMACSR_FBE                                         (0x1U<<12)
#define ETHERNET_DMACSR_ER                                          (0x1U<<11)
#define ETHERNET_DMACSR_ET                                          (0x1U<<10)
#define ETHERNET_DMACSR_RWT                                         (0x1U<<9)
#define ETHERNET_DMACSR_RPS                                         (0x1U<<8)
#define ETHERNET_DMACSR_RBU                                         (0x1U<<7)
#define ETHERNET_DMACSR_RI                                          (0x1U<<6)
#define ETHERNET_DMACSR_TBU                                         (0x1U<<2)
#define ETHERNET_DMACSR_TPS                                         (0x1U<<1)
#define ETHERNET_DMACSR_TI                                          (0x1U<<0)

// DMACMFCR Configuration

#define ETHERNET_DMACMFCR_MFCO                                      (0x1U<<15)
#define ETHERNET_DMACMFCR_MFC                                       (0x7FFU<<0)
#define ETHERNET_DMACMFCR_MFC_0                                     (0x1U<<0)
